**USARÉ ESTE NOTEBOOK PARA IMPORTAR LA DATA A SQL**

**IMPORTAMOS LAS LIBRERÍAS**

In [1]:
%pip install sqlalchemy
%pip install pymysql

Requirement already satisfied: sqlalchemy in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (1.4.27)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (from sqlalchemy) (1.1.2)
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: pymysql in /usr/local/Caskroom/miniconda/base/envs/ironhack/lib/python3.8/site-packages (1.0.2)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import sqlalchemy as alch
import pandas as pd
from getpass import getpass
import requests
import pymysql
import dotenv
import os

**ALMACENAMOS LA CONTRASEÑA Y CREAMOS LA RUTA DE CONEXIÓN**

In [26]:
password = getpass("Introduce tu contraseña ")
db_name = "elonmusk"
conec = f"mysql+pymysql://root:{password}@localhost/{db_name}"
engine = alch.create_engine(conec)
print("Hurray")

Introduce tu contraseña ········
Hurray

In [27]:
df = pd.read_csv('../Data/elonmusk/final4.csv')

**QUE TAN GRANDE ES MI DF**

In [28]:
df.shape

(12339, 10)

**MUY GRANDE ME TEMO, VAMOS A INTENTAR QUEDARNOS CON TODO**

In [29]:
df.sample()

,Unnamed: 0,id,tweet,date,nlikes,nreplies,nretweets,year,name,surname
6323,6323,1108812671346835456,@vincent13031925 @S_Padival @jimcramer Jim can...,2019-03-21 19:28:36,1456,129,94,2019,Elon,Musk

In [30]:
df["nueva"] = pd.to_datetime(df.date).dt.strftime('%Y-%m-%d %H:%M:%S')

In [31]:
df.head()

,Unnamed: 0,id,tweet,date,nlikes,nreplies,nretweets,year,name,surname,nueva
0,0,1373819373090050048,@bluemoondance74 @NASASpaceflight Going well. ...,2021-03-22 02:10:37,2678,234,134,2021,Elon,Musk,2021-03-22 02:10:37
1,1,1373735946244431873,@NASASpaceflight Hopefully will happen this de...,2021-03-21 20:39:07,7967,535,570,2021,Elon,Musk,2021-03-21 20:39:07
2,2,1373555480870621188,@newscientist True,2021-03-21 08:42:00,15510,539,409,2021,Elon,Musk,2021-03-21 08:42:00
3,3,1373507545315172357,@cleantechnica I am accumulating resources to ...,2021-03-21 05:31:31,143476,10500,12483,2021,Elon,Musk,2021-03-21 05:31:31
4,4,1373492611231535111,@CathieDWood When vast amounts of manufacturin...,2021-03-21 04:32:11,6568,376,425,2021,Elon,Musk,2021-03-21 04:32:11

**CORREMOS UNA QUERY PARA COMPROBAR QUE ESTÁ TODO OKEY**
     
     **AL NO CHEQUEAR EL ID, ME AÑADE VALORES DUPLICADOS EN SQL**

In [32]:
pd.read_sql_query("""SELECT * FROM user;""", engine)

   user_id  name surname
0        1  Elon    Musk

**ESCRIBIMOS UNA FUNCIÓN QUE ITERE POR NUESTRO DATAFRAME E INSERTE LOS DATOS EN SQL "TWEET"**

In [34]:
def insert(df):
    """
    Esta función inserta valores dentro de las tablas de SQL directamente desde el dataframe iterando por cada row
    """
    for i,row in df.iterrows():
        engine.execute(f"""
        INSERT INTO tweet (tweet, year, nlikes, nreplies, nretweets, user_user_id)
        VALUES ('{row.tweet}',{row.year},{row.nlikes},{row.nreplies},{row.nretweets},1);""")

**QUEDA PENDIENTE ALIMENTAR LA BASE DE DATOS CON TODA TODA LA INFORMACIÓN**

    **HASTA AHORA TAN SOLO HE RECIBIDO 77 ROW'S**

In [ ]:
insert(df)

In [36]:
pd.read_sql_query("""SELECT * FROM tweet;""", engine)

,tweet_id,tweet,year,nlikes,nreplies,nretweets,user_user_id
0,1,@bluemoondance74 @NASASpaceflight Going well. ...,2021,2678,234,134,1
1,2,@NASASpaceflight Hopefully will happen this de...,2021,7967,535,570,1
2,3,@newscientist True,2021,15510,539,409,1
3,4,@cleantechnica I am accumulating resources to ...,2021,143476,10500,12483,1
4,5,@CathieDWood When vast amounts of manufacturin...,2021,6568,376,425,1
...,...,...,...,...,...,...,...
72,73,@ErcXspace @SpaceX @NASASpaceflight @Erdayastr...,2021,23537,953,658,1
73,74,@TrevorMahlmann @SpacePadreIsle Celebrating a ...,2021,19599,403,713,1
74,75,@DraperYounce Wow!,2021,34106,745,686,1
75,76,@_Shameless_Plug @Falcon9Block5 @bluemoondance...,2021,2391,129,82,1
76,77,"@WholeMarsBlog Like @CyberpunkGame, but *with*...",2021,2739,121,124,1

**ESCRIBIMOS UNA FUNCIÓN QUE ITERE POR NUESTRO DATAFRAME E INSERTE LOS DATOS EN SQL "USER"**

In [ ]:
def insert(df):
    """
    Esta función inserta valores dentro de las tablas de SQL directamente desde el dataframe iterando por cada row
    """
    for i,row in df.iterrows():
        engine.execute(f"""INSERT INTO user VALUES ('{row.id}','{row.name}','{row.surname}');""")

**FUNCIÓN PARA LOS STRINGS**

In [ ]:
def checkstr(a,string):
    """
    Función que revisa en cada tabla si el name, surname y tweet existe o no.
    Devuelve True o False en función a lo anterior
    """
    if a == "tweet":
        query = list(engine.execute(f"SELECT tweet FROM tweet WHERE tweet = '{string}'"))
        if len(query) > 0:
            return True
        else:
            return False
    
    elif a == "name":
        query = list(engine.execute(f"SELECT name FROM user WHERE name = '{string}'"))
        if len(query) > 0:
            return True
        else:
            return False
    
    elif a == "surname":
        query = list(engine.execute(f"SELECT surname FROM user WHERE surname = '{string}'"))
        if len(query) > 0:
            return True
        else:
            return False

**FUNCIÓN PARA LOS INT**

In [ ]:
def checkint(a, numero):
    """
    Función que revisa en cada tabla si el id, year, nlikes, nreplies y nretweets existe o no.
    Devuelve True o False en función a lo anterior
    """
    if a == "id":
        query = list(engine.execute(f"SELECT id FROM tweet WHERE id = {numero}"))
        if len(query) > 0:
            return True
        else:
            return False
        
    elif a == "year":
        query = list(engine.execute(f"SELECT year FROM tweet WHERE year = {numero}"))
        if len(query) > 0:
            return True
        else:
            return False
        
    elif a == "nlikes":
        query = list(engine.execute(f"SELECT nlikes FROM tweet WHERE nlikes = {numero}"))
        if len(query) > 0:
            return True
        else:
            return False
        
    elif a == "nreplies":
        query = list(engine.execute(f"SELECT nreplies FROM tweet WHERE nreplies = {number}"))
        if len(query) > 0:
            return True
        else:
            return False
        
    elif a == "nretweets":
        query = list(engine.execute(f"SELECT nretweets FROM tweet WHERE nretweets = {number}"))
        if len(query) > 0:
            return True
        else:
            return False